max-verem/stm32_artnet_dmx/firmware/stm32_artnet_dmx_v0/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define DMX_BREAK_Pin GPIO_PIN_1
#define DMX_BREAK_GPIO_Port GPIOA
#define W5500_INT_Pin GPIO_PIN_4
#define W5500_INT_GPIO_Port GPIOA
#define W5500_SCS_Pin GPIO_PIN_0
#define W5500_SCS_GPIO_Port GPIOB
#define W5500_RST_Pin GPIO_PIN_1
#define W5500_RST_GPIO_Port GPIOB
#define TP0_Pin GPIO_PIN_12
#define TP0_GPIO_Port GPIOB
#define TP1_Pin GPIO_PIN_13
#define TP1_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/*
	TIM1, APB2 Timer Clock 96Mhz
	we want 1MHz timer output (for break scale 1)
	or 250Khz (for break scale 4)
*/
#define DMX_BREAK_FREQ_SCALE 4
#define DMX_BREAK_TIMER_PRESCALER_RAW (6 * DMX_BREAK_FREQ_SCALE)
#define DMX_BREAK_TIMER_PERIOD_RAW 16
#define DMX_BREAK_TIMER_PRESCALER (DMX_BREAK_TIMER_PRESCALER_RAW - 1)
#define DMX_BREAK_TIMER_PERIOD (DMX_BREAK_TIMER_PERIOD_RAW - 1)
#define DMX_BREAK_TIMER_VAR htim1

/*
	TIM3, APB1 Timer Clock 96Mhz
	we want 1KHz timer output
*/
#define SERVICE_TIMER_PRESCALER_RAW 96
#define SERVICE_TIMER_PERIOD_RAW 1000
#define SERVICE_TIMER_PRESCALER (SERVICE_TIMER_PRESCALER_RAW - 1)
#define SERVICE_TIMER_PERIOD (SERVICE_TIMER_PERIOD_RAW - 1)
#define SERVICE_TIMER_VAR htim3

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
